In [2]:
#import
import os
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [46]:
os.chdir('D:\My Documents\Data Science\heroku-deploy')
data = pd.read_csv('hiring.csv')

In [47]:
data.head()

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000

In [48]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   experience                  6 non-null      object
 1   test_score(out of 10)       7 non-null      float64
 2   interview_score(out of 10)  8 non-null      int64
 3   salary($)                   8 non-null      int64
dtypes: float64(1), int64(2), object(1)
memory usage: 384.0+ bytes

In [49]:
data.describe()

       test_score(out of 10)  interview_score(out of 10)    salary($)
count               7.000000                    8.000000      8.00000
mean                7.857143                    7.875000  63000.00000
std                 1.345185                    1.642081  11501.55269
min                 6.000000                    6.000000  45000.00000
25%                 7.000000                    6.750000  57500.00000
50%                 8.000000                    7.500000  63500.00000
75%                 8.500000                    9.250000  70500.00000
max                10.000000                   10.000000  80000.00000

In [50]:
#lets rename the columns
data.rename(columns={'test_score(out of 10)':'test_score', 
                     'interview_score(out of 10)':'interview_score', 
                     'salary($)':'salary'}, inplace=True)

In [51]:
data.isnull().any()

experience          True
test_score          True
interview_score    False
salary             False
dtype: bool

In [52]:
#replace null values
data['experience'].fillna(0, inplace=True)
data['test_score'].fillna(data['test_score'].mean(), inplace=True)

In [54]:
#experience mapping
exp_map = {'zero':0, 0:0, 'one':1, 'two':2, 'three':3, 'four':4, 'five':5, 'six':6, 
           'seven':7, 'eight':8, 'nine':9, 'ten':10, 'eleven':11}
data['experience'] = data['experience'].map(exp_map)

In [64]:
X = data.drop('salary', axis=1)
y = data['salary']

#another method
X = data.iloc[:, :3]
y = data.iloc[:, -1]

In [66]:
#Linear Regression
from sklearn.linear_model import LinearRegression
clf = LinearRegression()
clf.fit(X, y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [68]:
#dump or save the model using pickle
import pickle
pickle.dump(clf, open('model.pkl', 'wb'))

In [70]:
#load the model
model = pickle.load(open('model.pkl', 'rb'))

In [76]:
#try predict
model.predict([[0,8,6]])

array([45722.68644263])

In [72]:
'''
1. Train and create the model
2. Go to Anaconda Terminal and change the directory using "cd" and point to app.py location
3. index.html should be placed inside "templates" folder
4. Run python app.py and copy the localhost url, say http://127.0.0.1:5000/
5. Run it in Chrome

'''

[53290.89255945]

<module 'app' from 'D:\\My Documents\\Data Science\\heroku-deploy\\app.py'>